Revit 2024 API
ParameterTypeId.TrussFamilyVertWebStructuralTypesParam Property
 "Structural Framing Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId TrussFamilyVertWebStructuralTypesParam { get; }
Visual Basic
Public Shared ReadOnly Property TrussFamilyVertWebStructuralTypesParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ TrussFamilyVertWebStructuralTypesParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace